# <center> Data Formating
    
When working with data, we often want to format and clean our datasets. In this section, we will see how to apply basic transformations on columns.

# Native Functions

## Convert Column Types

### To Datetime

Already seen in the previous section

```python
pd.to_datetime(df['datetime_column'], format='%Y-%m-%d')
```

### Apply formating

We can convert a serie using the method 
```python
.astype(str)
```

In [2]:
import pandas as pd
import numpy as np
import json

In [3]:
df = pd.read_csv('Resources/data.csv')
df.head()

    name   age
0   Jane  32.0
1    Bob  43.0
2  Maggy  22.0
3   Andy   NaN

In [10]:
df.dtypes

name     object
age     float64
dtype: object

In [15]:
df.age.astype(str)

0    32.0
1    43.0
2    22.0
3     nan
Name: age, dtype: object

In [16]:
df.dtypes

name     object
age     float64
dtype: object

If we want to replace the serie by the new converted serie, we need to redefine it:

In [ ]:
df.age = df.age.astype(str)
df.dtypes

In [ ]:
df.age

**Question: What happens if we want to convert it to integer?**

In [ ]:
df.age.astype(int)

In [27]:
int('32.0')

ValueError: invalid literal for int() with base 10: '32.0'

In [26]:
int(float('32.0'))

32

## Working with null values

Sometimes, we want to get rid of null values in a dataframe. We can either remove the rows with null values, or fill the null values with a specific value.

**Important**: With pandas, null values are defined as `NaN` object. This is different from `None`.

In order to evaluate if values are None/Null, we should use the function `pd.notnull()` or `pd.isnull()`.

In [3]:
np.nan

nan

In [4]:
pd.notnull(np.nan)

False

In [5]:
pd.isnull(np.nan)

True

In [6]:
np.nan is None

False

In [7]:
if np.nan:
    print("Not null")

Not null

In [8]:
if None:
    print("Not null")

### pd.DataFrame.dropna()

In [ ]:
df = pd.read_csv('Resources/data.csv')

In [ ]:
df.dropna()

In [ ]:
df.dropna(how='all')

In [ ]:
df.dropna(subset=['name'])

The `inplace=True` argument replace the dataframe by the results.

In [ ]:
df.dropna(subset=['age'], inplace=True)
df

###  pd.DataFrame.fillna()

In [10]:
df = pd.read_csv('Resources/data.csv')
df.fillna(0)

    name   age
0   Jane  32.0
1    Bob  43.0
2  Maggy  22.0
3   Andy   0.0

We can also replace the value by the average of value.

In [9]:
age_mean = df.age.mean()
df.fillna(age_mean)

    name        age
0   Jane  32.000000
1    Bob  43.000000
2  Maggy  22.000000
3   Andy  32.333333

# Custom Functions

Until now, we have seen native transformation functions. But you can also define your own transformations.

## Apply to a Serie

First, let's create a function.

In [12]:
def convert_age_to_category(age):
    if age < 10:
        return "Children"
    elif age < 40:
        return "Young"
    else:
        return "Even younger"

In [13]:
df = pd.read_csv('Resources/data.csv')

In order to apply a function to a Serie, we use the method `apply`, that takes as an argument the function.

```python
df['column'].apply(function)
```

In [14]:
df['age'].apply(convert_age_to_category)

0           Young
1    Even younger
2           Young
3    Even younger
Name: age, dtype: object

We can create a new column that stores the result:

In [16]:
df['age_category'] = df['age'].apply(convert_age_to_category)
df

    name   age  age_category
0   Jane  32.0         Young
1    Bob  43.0  Even younger
2  Maggy  22.0         Young
3   Andy   NaN  Even younger

### Lambda Functions - Very Small Explanation

In python, lambda functions are used to define function as one-liner.

In [23]:
age_cat_func = lambda x: "Young" if x < 20 else "Not so young"
age_cat_func

In [24]:
age_cat_func(15)

'Young'

### How to apply it to series?

In [25]:
df['age_category_lambda'] = df['age'].apply(lambda x: "Young" if x < 10 else "Not so young")
df

    name   age  age_category age_category_lambda
0   Jane  32.0  Not so young        Not so young
1    Bob  43.0  Not so young        Not so young
2  Maggy  22.0  Not so young        Not so young
3   Andy   NaN  Not so young        Not so young

## Exercice

Create a new column "age_int" that converts the age into an integer.

1. First, write the function.
2. Then apply it to the column.

In [28]:
# TO DO

## Apply to a dataframe

We can also imagine a transformation that takes as an argument multiple columns and returns an output.

In [32]:
df = pd.read_csv('Resources/data_concat.csv')

In [33]:
df

   day  month  year first_name   last_name
0    1      9  2021       Andy     Barakat
1    5      1  2011    Maxence     Haouari
2   10     11  2020     Astrid  De Jullien

Let's create a function that takes 2 arguments: first and last name, and returns the full name.

In [36]:
def generate_full_name(first_name, last_name):
    return f"{first_name} {last_name}"

generate_full_name("Andy", "Barakat")

'Andy Barakat'

To apply the function to a dataframe, we use the apply function as well, with a lambda. `x` represents the row. 
x['column_name'] is the value the column_name of the row `x`.

In [39]:
df['full_name'] = df.apply(lambda x: generate_full_name(x['first_name'], x['last_name']), axis=1)
df

   day  month  year first_name   last_name          full_name
0    1      9  2021       Andy     Barakat       Andy Barakat
1    5      1  2011    Maxence     Haouari    Maxence Haouari
2   10     11  2020     Astrid  De Jullien  Astrid De Jullien

**Another Approach**

Another approach is to create a function that takes as argument the entire row, and select the columns in the function.

In [42]:
def generate_full_name(row):
    return f"{row['first_name']} {row['last_name']}"

row = df.loc[0]
generate_full_name(row)

'Andy Barakat'

In [45]:
df['full_name'] = df.apply(generate_full_name, axis=1)
df

   day  month  year first_name   last_name          full_name
0    1      9  2021       Andy     Barakat       Andy Barakat
1    5      1  2011    Maxence     Haouari    Maxence Haouari
2   10     11  2020     Astrid  De Jullien  Astrid De Jullien

## Exercice

1. Create a function that create a date "YYYY-MM-DD" from a day, month and year.
2. Apply the function to the dataframe to create the column.

_Hint_: Try ```'%02d' % int(5)```, to add a leading zero if needed. For example:

In [57]:
integer = 8
'%02d' % int(integer)

'08'

In [47]:
def convert_to_date(day, month, year):
    """
    Convert to "YYYY-MM-DD"
    """

# Helpful examples: parsing dictionnary

In [85]:
def get_attribute_from_dict(my_dict, attribute):
    return my_dict.get(attribute)

df = pd.read_csv('Resources/data_embed.csv', sep=';')
df

   user_id                                              views
0       10             {"listings":["listing_a","listing_b"]}
1       11  {"listings":["listing_c","listing_d","listing_...

In [86]:
df['views_dict'] = df['views'].apply(lambda x: json.loads(x))
df.dtypes

user_id        int64
views         object
views_dict    object
dtype: object

In [87]:
type(df.loc[0]['views'])

str

In [88]:
type(df.loc[0]['views_dict'])

dict

In [89]:
df['number_listings'] = df['views_dict'].apply(lambda x: len(x['listings']))
df

,user_id,views,views_dict,number_listings
0,10,"{""listings"":[""listing_a"",""listing_b""]}","{'listings': ['listing_a', 'listing_b']}",2
1,11,"{""listings"":[""listing_c"",""listing_d"",""listing_...","{'listings': ['listing_c', 'listing_d', 'listi...",3